Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Перемещение/Ext/ObjectModule.bsl
Процедура ПересчитатьСтроку(Стр)
	Стр.ЦенаЗакупки = омСервер.ПересчетЗн(Стр.Партия.ЦенаЗакупки, Стр.Партия.Валюта, Валюта, Фирма, Дата, Фирма.ЧислоЗнаковЦенаЗакупки);
	Стр.СуммаЗакупки = Стр.ЦенаЗакупки * Стр.Количество;
	// © Primus1C  03.12.2025  НАЧАЛО ►
	Стр.СуммаЗакупки = Стр.ЦенаЗакупки * Стр.Количество;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	//2016.07.15
	Стр.Серия = Стр.Партия.Серия;
КонецПроцедуры

Процедура ПересчитатьИтоги()      
	// © Primus1C  23.12.2023  НАЧАЛО ►
	Количество =  Товары.Итог("Количество");
	// © Primus1C  ОКОНЧАНИЕ ◄
	Сумма = Товары.Итог("СуммаЗакупки");
	Строк = Товары.Количество();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// © Primus1C  02.04.2025  НАЧАЛО ►
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;      
	// © Primus1C  ОКОНЧАНИЕ ◄

	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Фирма) Тогда Фирма = гоФирма() КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	//КемСохранен = гоПользователь();
	//Сохранен = ТекущаяДата();
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
	БылФлагНеПроверятьОстатки = ФлагНеПроверятьОстатки;
	Если (БылФлагНеПроверятьОстатки = 1) ИЛИ (БылФлагНеПроверятьОстатки = 9) Тогда 
		ФлагНеПроверятьОстатки = 2;
		Если БылФлагНеПроверятьОстатки = 9 Тогда Возврат КонецЕсли; 
	ИначеЕсли БылФлагНеПроверятьОстатки = 2 Тогда 
		ФлагНеПроверятьОстатки = 0;
	КонецЕсли;
	
	Для Каждого Стр Из Товары Цикл
		ПересчитатьСтроку(Стр);
	КонецЦикла;
	ПересчитатьИтоги(); 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = глПрефиксДефис(Фирма);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли;  
	
	// © Primus1C  21.12.2023  НАЧАЛО ►
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда  
		
		Фирма 				= ДанныеЗаполнения.Фирма;
		ДокументОснование 	= ДанныеЗаполнения.Ссылка; 
		Склад				= ДанныеЗаполнения.Склад;
	    Валюта              = ДанныеЗаполнения.Валюта;

		Товары.Загрузить(ОбщегоНазначенияСервер.ОстаткиПриходнойНакладной(ДокументОснование));
		
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если (ФлагНеПроверятьОстатки <> 2) И (Товары.Количество() > 0) Тогда  
		НадоЗаписать = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	МИНИМУМ(ДокТовары.НомерСтроки) КАК НомерСтроки,
		               |	ДокТовары.Номенклатура КАК Номенклатура,
		               |	ДокТовары.Партия КАК Партия,
		               |	СУММА(ДокТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ ВТТовары
		               |ИЗ
		               |	Документ.Перемещение.Товары КАК ДокТовары
		               |ГДЕ
		               |	ДокТовары.Ссылка = &Ссылка
		               |	И ДокТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокТовары.Номенклатура,
		               |	ДокТовары.Партия
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура,
		               |	Партия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТТовары.НомерСтроки КАК НомерСтроки,
		               |	ВТТовары.Номенклатура КАК Номенклатура,
		               |	ВТТовары.Партия КАК Партия,
		               |	ВТТовары.Количество КАК Количество,
		               |	ЕСТЬNULL(ОстПар.ОстатокОстаток, 0) КАК Остаток
		               |ИЗ
		               |	ВТТовары КАК ВТТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
		               |				,
		               |				Партия В
		               |						(ВЫБРАТЬ
		               |							Т.Партия
		               |						ИЗ
		               |							ВТТовары КАК Т)
		               |					И Склад = &Склад
		               |					И Фирма = &Фирма) КАК ОстПар
		               |		ПО ВТТовары.Партия = ОстПар.Партия";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Фирма", Фирма);
		
		Исправлений = 0;
		Первое = Истина;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.Партия) Тогда Продолжить КонецЕсли; 
			
			Если Выборка.Количество <= Выборка.Остаток Тогда Продолжить КонецЕсли; 
			Если Первое Тогда Сообщить("Проведение " + Ссылка + " - не хватило остатков партий:"); Первое = Ложь; КонецЕсли; 
			
			Сообщить(гоИмя(Выборка.Партия) + ": количество = " + Выборка.Количество + " больше остатка = " + Выборка.Остаток + "! ИСПРАВЛЕНО!!!");
			
			БылоКолво = Выборка.Количество;		 	
			Колич = Выборка.Остаток;
			Номен = Выборка.Партия.Владелец;
			гоЗаписьЖурналаРегистрации(Строка(БылоКолво) + "->" + Строка(Колич) + "|" + гоИмя(Ссылка, Ложь), "Перемещение", "Не хватило при проведении", Номен, 2);
			гоЗаписьЖурналаРегистрации(Строка(БылоКолво) + "->" + Строка(Колич) + "|" + гоИмя(Номен, Ложь), "Перемещение", "Не хватило при проведении", Ссылка, 2);
			
			локОстаток = Выборка.Остаток;
			Если локОстаток < 0 Тогда локОстаток = 0 КонецЕсли;
			Отнять = Выборка.Количество - локОстаток;
			
			Нашли = Товары.НайтиСтроки(Новый Структура("Партия", Выборка.Партия));
			Если Нашли.Количество() = 0 Тогда Отказ = Истина; Сообщить("Странная ошибка! Вообще не нашли " + гоИмя(Выборка.Партия)); Возврат; КонецЕсли; 
			
			Для Каждого Лтр Из Нашли Цикл
				Если Лтр.Количество >= Отнять Тогда
					Лтр.Количество = Лтр.Количество - Отнять;
					Отнять = 0;
				Иначе
					Отнять = Отнять - Лтр.Количество;
					Лтр.Количество = 0;
				КонецЕсли; 
				Исправлений = Исправлений + 1;
				Если Отнять = 0 Тогда Прервать КонецЕсли; 
			КонецЦикла; 
			
			Если Отнять <> 0 Тогда Отказ = Истина; Сообщить("Странная ошибка! Не смогли уменьшить количество на " + Отнять + " для " + гоИмя(Выборка.Партия)); Возврат; КонецЕсли; 
		КонецЦикла;
		
		НадоЗаписать = НЕ (Исправлений = 0);
		Если НадоЗаписать Тогда Записать(РежимЗаписиДокумента.Запись) КонецЕсли; 
	КонецЕсли; 
	
    ЕстьОстатки = Ложь;
    ЕстьРезервы = Ложь;
	
	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда Продолжить КонецЕсли; 
		Если Стр.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда Продолжить КонецЕсли; 
		
		Движение = Движения.ОстаткиТовара.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Склад = Склад;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Партия = Стр.Партия;
		Движение.Остаток = Стр.Количество;
		Движение.Резерв = 0;
		ЕстьОстатки = Истина;
		
		Если НЕ Окончательно Тогда
			Движение = Движения.ОстаткиТовара.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Склад = Склад;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Партия = Стр.Партия;
			Движение.Остаток = 0;
			Движение.Резерв = Стр.Количество;
			ЕстьОстатки = Истина;
			
			//Движение = Движения.РезервыТовара.ДобавитьПриход();
			//Движение.Период = Дата;
			//Движение.Фирма = Фирма;
			//Движение.Склад = Склад;
			//Движение.Номенклатура = Стр.Номенклатура;
			//Движение.Партия = Стр.Партия;
			//Движение.Док = Ссылка;
			//Движение.Остаток = Стр.Количество;
			//ЕстьРезервы = Истина;
		Иначе
			Движение = Движения.ОстаткиТовара.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Склад = Куда;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Партия = Стр.Партия;
			Движение.Остаток = Стр.Количество;
			Движение.Резерв = 0;
			ЕстьОстатки = Истина;
		КонецЕсли; 
	КонецЦикла;
	
	Движения.ОстаткиТовара.Записывать = ЕстьОстатки;
	//Движения.РезервыТовара.Записывать = ЕстьРезервы;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если гоАдминистратор() Тогда Возврат КонецЕсли; 
	
	Если Окончательно Тогда Сообщить(НСтр("ru = 'Отмена проведения невозможна! Документ закрыт {Окончательно}!'; en = 'Unposted is not possible! The document is closed <Finally>!'")); Отказ = Истина; КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда Сообщить(НСтр("ru = 'Отмена проведения невозможна! Документ не пустой!'; en = 'Unposted is not possible! The document is not empty!'")); Отказ = Истина; КонецЕсли;
	
	//Если НЕ (гоМельник() ИЛИ гоКолинко() ИЛИ гоЕстьРоль("КомуВчераСклад")) Тогда
	//	Если НачалоДня(Дата) < гоТекущаяДата() Тогда
	//		Сообщить("Только Избранный!"); Отказ = Истина; Возврат; КонецЕсли; КонецЕсли; 
КонецПроцедуры
